DataProcessors/ПеремещениеТовараИзЯчейки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПеремещениеТовараИзЯчейки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКудаГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаОткуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаОткудаГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеИзЯчейкиМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПеремещениеТовараИзЯчейки/Forms/ФормаПеремещениеНоменклатуры/Ext/Form/Module.bsl
&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем РежимВводаАвтоматический;
&НаКлиенте
Перем Ошибка;
&НаКлиенте
Перем ПолученоОписаниеШапки;
&НаКлиенте
Перем СозданДокументПеремещения;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискЯчейкиОткуда");
	ОбщегоНазначения.УстановитьРежимВводаНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискОткуда(Команда) 
	
	Если Не ЗначениеЗаполнено(Объект.ЯчейкаОткуда) Тогда
		ПоказатьПредупреждение(, "Ячейка ""Откуда"" должна быть заполнена", 4);	
	КонецЕсли; 
	
	Объект.ЯчейкаОткуда = ВРег(Объект.ЯчейкаОткуда);
	ЗапроситьЯчейкуСсервера(Объект.ЯчейкаОткуда, "ЯчейкаОткуда");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискКуда(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ЯчейкаКуда) Тогда
		ПоказатьПредупреждение(, "Ячейка ""Куда"" должна быть заполнена", 4);	
	КонецЕсли; 
	
	Объект.ЯчейкаКуда = ВРег(Объект.ЯчейкаКуда);
	ЗапроситьЯчейкуСсервера(Объект.ЯчейкаКуда, "ЯчейкаКуда");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЗРучнойНабор()
	
	РучнойВводКоличества.Очистить();
	СтрокаТЗ = РучнойВводКоличества.Добавить();
	СтрокаТЗ.Заголовок = "Кол.:";
	СтрокаТЗ.ЗнакБольше = ">";
	СтрокаТЗ.ЗнакМеньше = "<";
	СтрокаТЗ.ВведенноеКоличествоВРучную = 1;
	Элементы.РучнойВводКоличества.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолученоОписаниеШапки = Ложь;
	СозданДокументПеремещения = Ложь;
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();	
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда		
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);                                                   
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
	КонецЕсли;	
	
	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();	
		
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);	
	ОбщегоНазначенияКлиент.ЗаполнитьТЧКнопокДляШКнеНайден(ЭтаФорма);
	ЗаполнитьТЗРучнойНабор();
	
	ПодключитьОбработчикОжидания("ПерейтиКСтатусуПоискаНоменклатуры", 2, Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОписаниеШапкиФормы()
	
	//Результат = ОбщегоНазначения.ПолучитьОписаниеШапкиДляПеремещения(Объект.ЯчейкаОткудаГУИД, Объект.ЯчейкаКудаГУИД);
	//Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
	//	ПоказатьПредупреждение(,"Ошибка: " + Результат.Ошибка, 4);	
	//	Возврат;
	//КонецЕсли;
	//
	//ШапкаОсталосьИПеремещено.Очистить();
	//СтрокаТЗ = ШапкаОсталосьИПеремещено.Добавить();
	//СтрокаТЗ.КоличествоОстаток = Результат.Данные[0].КоличествоОстаток;
	//СтрокаТЗ.КоличествоПеремещено = Результат.Данные[0].КоличествоПеремещено;
	//СтрокаТЗ.ОписаниеШапки = "Набрано: " + Строка(СтрокаТЗ.КоличествоПеремещено) + " ед."; 
	
	ШапкаОсталосьИПеремещеноОписаниеШапки = "Набрано: " + Строка(КоличествоНабраноТСД) + " ед."; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	СтрокаТЗ.ОписаниеРежимаВводаКоличества = ОбщегоНазначенияКлиент.ПолучитьОтображениеОРежимеВводеКоличества();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = ОбщегоНазначения.ПолучитьИнструкциюДействийДляПользователя_ПеремещениеТоваров(ОписаниеОшибки, ЭтаФорма.ИмяФормы);
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры
  
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)

	Если Не ВводДоступен() Тогда
		Возврат;
	КонецЕсли; 
	
	//+Шульман А. 19.12.2025 #UT10-5599
	СимволРазделитель = "{GS}";
	//-Шульман А. 19.12.2025 #UT10-5599
	
	Если Событие = "UniversalBroadcastEvent" Тогда

		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные, СимволРазделитель);
		
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода" + СокрЛП(Результат.Ошибка), 40);
			Возврат;
			
		КонецЕсли; 
		
		ЭтаФорма.Штрихкод = Результат.Штрихкод;		
		ЭтаФорма.ТоварГУИД = "";
		
		СтатусРаботы = ОбщегоНазначения.ПолучитьСтатусРаботыСПеремещениемТовара();
		
		Если СтатусРаботы = "ПоискЯчейкиОткуда"  Тогда
			ЗапроситьЯчейкуСсервера(ЭтаФорма.Штрихкод, "ЯчейкаОткуда");	
		ИначеЕсли СтатусРаботы = "ПоискЯчейкиКуда" Тогда
			ЗапроситьЯчейкуСсервера(ЭтаФорма.Штрихкод, "ЯчейкаКуда");	
		КонецЕсли; 
		
		Если СтатусРаботы = "ОпределеныЯчейкиДляПоискаТовара" Или СтатусРаботы = "ПоискНоменклатуры" Тогда
			
			//+Шульман А. 19.12.2025 #UT10-5599
			СтрокаGS = "";
			
			Если ОбщегоНазначения.ПолучитьКонстанту("РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ") Тогда
			
				Попытка
					
					СтрокаGS = ОбщегоНазначенияКлиент.ПолучитьПозицииGS(ЭтаФорма.Штрихкод, СимволРазделитель);
					
					Пока НЕ СтрНайти(ЭтаФорма.Штрихкод, СимволРазделитель) = 0 Цикл
						ЭтаФорма.Штрихкод = СтрЗаменить(ЭтаФорма.Штрихкод, СимволРазделитель,"");
					КонецЦикла;
					
				Исключение                                           
					
					ASK_ОбработкаОшибок.ЗаписатьИнформациюВЛогОшибок("Ошибка", ЭтаФорма.Штрихкод + ". " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), 
					"ФормаПеремещениеНоменклатуры. ВнешнееСобытие", "Поиск GS");   
					Возврат;
					
				КонецПопытки;     
			
			КонецЕсли;   
			//-Шульман А. 19.12.2025 #UT10-5599
			
			ОбработкаОтсканированногоТовара();								
			
			//Проверка = ОбщегоНазначенияКлиент.СканированныйШтрихкодЯвляетсяЯчейкой(ЭтаФорма.Штрихкод, Объект.ЯчейкаКуда);
			//Если Проверка Тогда
			//	
			//	ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();			
			//	СоздатьДокументПеремещенияПослеСканирЯчейкиКуда(Объект);
			//	
			//Иначе 				
			//	
			//	//Если Не ПолученоОписаниеШапки Тогда
			//	//	ОбновитьОписаниеШапкиФормы();
			//	//	ПолученоОписаниеШапки = Истина;
			//	//КонецЕсли; 
			//	
			//	//ОбработкаОтсканированногоТовара();					
			//КонецЕсли; 

		КонецЕсли; 
					
	ИначеЕсли Событие = "ClipboardEvent" Тогда
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьЯчейкуОткуда(ПромЯчейка) 
	//+Кабанов А.В. 13.08.2025 # UT10-5360		
	Результат = Ложь;
	КонстантаЯчейкаМаркировки = Константы.ЯчейкаДляМаркировки.Получить();
	
	Если ЗначениеЗаполнено(КонстантаЯчейкаМаркировки) Тогда    
		
		ОбщегоНазначения.УстановитьРежимВводаНаСервере(Истина);

		Возврат КонстантаЯчейкаМаркировки = ПромЯчейка;        
		
	КонецЕсли;
	
	Возврат Результат;
	//-Кабанов А.В. 13.08.2025 # UT10-5360	
КонецФункции

&НаКлиенте
Процедура ОбновитьФормуПеремещениеИзЯчейкиМаркировка()
	//+Кабанов А.В. 13.08.2025 # UT10-5360		
	Если Объект.ПеремещениеИзЯчейкиМаркировка Тогда
		Элементы.ЯчейкаОткуда1.ЦветТекста = WebЦвета.Красный;
	Иначе
		Элементы.ЯчейкаОткуда1.ЦветТекста = WebЦвета.ТемноЗеленый;	
	КонецЕсли;  
	
	Элементы.ПодвалОписаниеРежимаВводаКоличества.Доступность = Не Объект.ПеремещениеИзЯчейкиМаркировка;
	//-Кабанов А.В. 13.08.2025 # UT10-5360		
Конецпроцедуры

&НаКлиенте
Процедура ЗапроситьЯчейкуСсервера(Текст, ВидЯчейки)
	
	ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();
	
	Результат = ОбщегоНазначения.ПолучитьЯчейку(Текст);                     
	
	Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
		
		ТекстОшибки = "Ячейка " + Текст + " некорректна !!!" + Символы.ПС;
		ТекстОшибки = ТекстОшибки + Результат.Ошибка;
		ПоказатьПредупреждение(,"Ошибка: " + ТекстОшибки, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ТекстОшибки, "Ячейка");							
		
		Если ВидЯчейки = "ЯчейкаОткуда" Тогда
			
			Объект.ЯчейкаОткудаГУИД = "";		
			Объект.ЯчейкаОткуда = "";
			
		ИначеЕсли ВидЯчейки = "ЯчейкаКуда" Тогда
			
			Объект.ЯчейкаКудаГУИД = "";		
			Объект.ЯчейкаКуда = "";			

		КонецЕсли; 
		
		Возврат;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Результат.Данные) Тогда	
		
		РезультатСтруктура = ОбщегоНазначения.ЕстьЛиТоварыВЯчейке(Результат.Данные);
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
			Возврат;
		КонецЕсли;
		
		Если ВидЯчейки = "ЯчейкаОткуда" Тогда
						
			Если Не РезультатСтруктура.Данные Тогда			
				ПоказатьПредупреждение(,"В ячейке " + Результат.Данные + " нет товаров для перемещения.", 4);	
				Возврат;			
			КонецЕсли; 
			
			Объект.ЯчейкаОткудаГУИД = Результат.Данные;
			Объект.ЯчейкаОткуда = Текст;				
			ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискЯчейкиКуда");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();

		ИначеЕсли ВидЯчейки = "ЯчейкаКуда" Тогда 
			
			Объект.ЯчейкаКудаГУИД = Результат.Данные;
			Объект.ЯчейкаКуда = Текст;				
			
			Если Объект.ЯчейкаКудаГУИД = Объект.ЯчейкаОткудаГУИД Тогда
				
				ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
				ПоказатьПредупреждение(,"Ошибка: Ячейка ""Откуда"" и ""Куда"" должны различаться", 4);	
				Объект.ЯчейкаКудаГУИД = "";		
				Объект.ЯчейкаКуда = "";							
				Возврат;
				
			КонецЕсли; 
						
			ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ОпределеныЯчейкиДляПоискаТовара");			
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();	
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Объект.ЯчейкаКудаГУИД) И ЗначениеЗаполнено(Объект.ЯчейкаОткудаГУИД) Тогда 
			
			//+Кабанов А.В. 13.08.2025 # UT10-5360		
			Объект.ПеремещениеИзЯчейкиМаркировка = ПроверитьЯчейкуОткуда(Объект.ЯчейкаОткудаГУИД);
			ОбновитьФормуПеремещениеИзЯчейкиМаркировка();
			//-Кабанов А.В. 13.08.2025 # UT10-5360 
			
			ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ОпределеныЯчейкиДляПоискаТовара");
			
		КонецЕсли; 
		
	КонецЕсли;	
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоТовара()
	
	Оповестить("ГруппаПоискаТовара", Ложь);		
	Элементы.ГруппаПоискаТовара.Видимость = Ложь;
	
	РежимВводаАвтоматический = ОбщегоНазначения.УстановленРежимВводаАвтоматический();	
	
	Если РежимВводаАвтоматический Тогда
		
		Результат = ОбработкаШтрихкодаАвтоматический.ОбработкаШтрихкодаВАвтоматическомРежиме(ЭтаФорма, "ПеремещениеТовараИзЯчейки");
		
		Если Результат = "ЗакрытиеЯчейкиПриемки" Тогда
			Возврат;			
		ИначеЕсли Результат =  "ЯчейкаНеСоотвестЯчейкиПриемки" Тогда  
			
			ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();					
			Возврат;
			
		Иначе
		
			ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если Не РежимВводаАвтоматический Тогда
		
		Результат = ОбработкаШтрихкодаРучной.ОбработкаШтрихкодаВРучномРежиме(ЭтаФорма,"ПеремещениеТовараИзЯчейки");
		Если Результат = "ЗакрытиеЯчейкиПриемки" Тогда
			Возврат;			
		ИначеЕсли Результат =  "ЯчейкаНеСоотвестЯчейкиПриемки" Тогда  
			
			ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();					
			Возврат;
			
		Иначе
			
			ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ВводКоличестваНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();				
			
		КонецЕсли;
		
	КонецЕсли; 	
	
	Если Результат = "НеизвестныйШтрихкод" Тогда                                 
		
		Структура = Новый Структура;
		Структура.Вставить("Штрихкод", Штрихкод);                            
		Структура.Вставить("ЭтаФорма", ЭтаФорма);					
		
		ОбщегоНазначенияКлиент.ИнициализацияТЗ_Набрано(ЭтаФорма);
		ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ШКнеНайденВЯчейке");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		                           
		                                                
	КонецЕсли; 
	
	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров() Экспорт
	
	Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_РаботаСТоваром;	
	
	ОбновитьСлуженоеСообщениеПодвал();	
	Элементы.КнопкаПропустить.Видимость = Ложь;
	Элементы.КнопкаДобавитьШтрихкод.Видимость = Ложь;
	Элементы.КнопкаВыбратьТоварИзДокумента.Видимость = Ложь;	
	ОбновитьОписаниеШапкиФормы();
	
	СтатусРаботы = ОбщегоНазначения.ПолучитьСтатусРаботыСПеремещениемТовара();
	
	Если СтатусРаботы = "ПоискЯчейкиОткуда" Или СтатусРаботы = "ПоискЯчейкиКуда" Или СтатусРаботы = "ОпределеныЯчейкиДляПоискаТовара" Тогда
		
		Элементы.ГруппаШапка.Видимость = Ложь;
		Элементы.ГруппаЯчейкиОткуда.Видимость = Истина;
		Элементы.ГруппаЯчейкиКуда.Видимость = Истина;		
		Элементы.КнопкаЗаглушка.Видимость = Истина;
		Элементы.ГруппаОткудаИКуда.Видимость = Ложь;
		Элементы.ГруппаСтраницыРаботаСТоваров.Видимость = Ложь;
		Возврат;
		
	Иначе 
		
		Элементы.ГруппаШапка.Видимость = Истина;
		Элементы.ГруппаСтраницыРаботаСТоваров.Видимость = Истина;
		Элементы.ГруппаОткудаИКуда.Видимость = Истина;
		Элементы.КнопкаЗаглушка.Видимость = Ложь;
		Элементы.ГруппаЯчейкиОткуда.Видимость = Ложь;
		Элементы.ГруппаЯчейкиКуда.Видимость = Ложь;
		
	КонецЕсли; 
	
	Элементы.Набрано.Обновить();  
	
	Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
		
		Элементы.ГруппаСтраницыРаботаСТоваров.ТекущаяСтраница = Элементы.ГруппаСтраница_ОшибкаСканирования;
		Элементы.ГруппаСтраница_АвтоматическийВвод.Видимость = Ложь;
		Элементы.ГруппаСтраница_ОшибкаСканирования.Видимость = Истина;
		Элементы.ГруппаСтраница_РучнойВвод.Видимость = Ложь;			
		
		Возврат;
		
	КонецЕсли; 
		
	РежимВводаАвтоматический = ОбщегоНазначения.УстановленРежимВводаАвтоматический();
	
	Если РежимВводаАвтоматический И  СтатусРаботы <> "ШКнеНайденВЯчейке" Тогда
		
		Элементы.ГруппаСтраницыРаботаСТоваров.ТекущаяСтраница = Элементы.ГруппаСтраница_АвтоматическийВвод;
		Элементы.ГруппаСтраница_АвтоматическийВвод.Видимость = Истина;
		Элементы.ГруппаСтраница_ОшибкаСканирования.Видимость = Ложь;
		Элементы.ГруппаСтраница_РучнойВвод.Видимость = Ложь;			
		
	ИначеЕсли Не РежимВводаАвтоматический И СтатусРаботы = "ВводКоличестваНоменклатуры" Тогда 
		
		Элементы.ГруппаСтраницыРаботаСТоваров.ТекущаяСтраница = Элементы.ГруппаСтраница_РучнойВвод;
		Элементы.ГруппаСтраница_АвтоматическийВвод.Видимость = Ложь;
		Элементы.ГруппаСтраница_ОшибкаСканирования.Видимость = Ложь;
		Элементы.ГруппаСтраница_РучнойВвод.Видимость = Истина;		
		
	ИначеЕсли Не РежимВводаАвтоматический И СтатусРаботы = "ПоискНоменклатуры" Тогда 
		
		Элементы.ГруппаСтраницыРаботаСТоваров.ТекущаяСтраница = Элементы.ГруппаСтраница_АвтоматическийВвод;
		Элементы.ГруппаСтраница_АвтоматическийВвод.Видимость = Истина;
		Элементы.ГруппаСтраница_ОшибкаСканирования.Видимость = Ложь;
		Элементы.ГруппаСтраница_РучнойВвод.Видимость = Ложь;		
				
	ИначеЕсли СтатусРаботы = "ШКнеНайденВЯчейке" Тогда
		
		Элементы.ГруппаСтраницыРаботаСТоваров.ТекущаяСтраница = Элементы.ГруппаСтраница_ОтсутствиеШК_вПоставке;		
		Элементы.ГруппаСтраница_ОтсутствиеШК_вПоставке.Видимость = Истина;
		Элементы.ГруппаСтраница_АвтоматическийВвод.Видимость = Ложь;
		Элементы.ГруппаСтраница_ОшибкаСканирования.Видимость = Ложь;
		Элементы.ГруппаСтраница_РучнойВвод.Видимость = Ложь;		

		Элементы.КнопкаПропустить.Видимость = Истина;
		Элементы.КнопкаДобавитьШтрихкод.Видимость = Истина;
		Элементы.КнопкаВыбратьТоварИзДокумента.Видимость = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискТовара(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Поиск) Тогда
		Сообщить("Введите код производителя или штрихкод.");
		Возврат;
	КонецЕсли; 
		
	ЭтаФорма.Штрихкод = ЭтаФорма.Поиск;
	ЭтаФорма.ТоварГУИД = "";    
	СтрокаGS = "";
				
	ОбработкаОтсканированногоТовара();			

КонецПроцедуры

&НаКлиенте
Процедура ВключитьПоискТовара(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ЯчейкаОткуда) Или Не ЗначениеЗаполнено(Объект.ЯчейкаКуда) Тогда
		ПоказатьПредупреждение(, "Нужнно ввести или отсканировать код ячейки ""Откуда"" или ""Куда"".", 4);		
		Возврат;
	КонецЕсли;
		
	ЭтаФорма.ОписаниеОшибки = "";
	ЭтаФорма.ОписаниеНайденногоТовара =  "";
	ЭтаФорма.Штрихкод = "";
	ЭтаФорма.Поиск = "";
	
	ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);		
	ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискНоменклатуры");		
	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();	
	
	Оповестить("ГруппаПоискаТовара", Истина);	
	Оповестить("СканированиеШтрихкода");		

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
	Если ИмяСобытия = "СканированиеШтрихкода" Тогда
		
		#Если МобильноеПриложениеКлиент Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
			Компонента.Отключить();
		Иначе
			Компонента.Подключить();
		КонецЕсли; 
		#КонецЕсли 	
	
		Возврат;		
		
	КонецЕсли; 

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	Если ИмяСобытия = "ГруппаПоискаТовара" Тогда
		
		Элементы.ГруппаПоискаТовара.Видимость = Параметр;
		ЭтаФорма.Поиск = "";
		Возврат;
		
	КонецЕсли; 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСканирование(Команда)
	
	ЭтаФорма.ОписаниеОшибки = "";
	ЭтаФорма.ОписаниеНайденногоТовара =  "";
	//ЭтаФорма.Штрихкод = "";
	//ЭтаФорма.ТоварГУИД = "";
	ЭтаФорма.Поиск = "";	
	//ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);	
		
	ОбщегоНазначенияКлиент.ПолучитьИнформациюОТовареДляПеремещенияТовара(ЭтаФорма);
	ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискНоменклатуры");
	ОбщегоНазначения.УстановитьРежимВводаНаСервере(Истина);	
	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
	
	Оповестить("ГруппаПоискаТовара", Ложь);
	Оповестить("СканированиеШтрихкода");	

КонецПроцедуры

&НаКлиенте
Процедура ПодвалВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПодвалОписаниеРежимаВводаКоличества"  Тогда
		
		ОбщегоНазначения.УстановитьРежимВводаНаСервере();
		ОбновитьСлуженоеСообщениеПодвал();

	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимВвода(Команда)
	
	ОбщегоНазначения.УстановитьРежимВводаНаСервере();
	ОбновитьСлуженоеСообщениеПодвал();

КонецПроцедуры
 
&НаКлиенте
Процедура КнопкаВнестиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КнопкаВнестиОк" Тогда
		
		ОбработкаШтрихкодаРучной.ОбработатьВведеноеКоличествоТовара(ЭтаФорма,  "ПеремещениеТовараИзЯчейки");		
		ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискНоменклатуры");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура РучнойВводКоличестваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "РучнойВводКоличестваЗнакМеньше" Тогда
		
		Если РучнойВводКоличества[0].ВведенноеКоличествоВРучную > 1 Тогда
			РучнойВводКоличества[0].ВведенноеКоличествоВРучную = РучнойВводКоличества[0].ВведенноеКоличествоВРучную - 1;	
		КонецЕсли; 
				
	ИначеЕсли Поле.Имя = "РучнойВводКоличестваЗнакБольше" Тогда 
		
		РучнойВводКоличества[0].ВведенноеКоличествоВРучную = РучнойВводКоличества[0].ВведенноеКоличествоВРучную + 1;	
		
	ИначеЕсли Поле.Имя = "РучнойВводКоличестваВведенноеКоличествоВРучную" Тогда 
		
		Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхПриЗакрытииФормыВводКоличестваВРучную", ЭтаФорма);				
		ПараметрыФормы = Новый Структура("Количество", РучнойВводКоличества[0].ВведенноеКоличествоВРучную);
		ОткрытьФорму("Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаВводКоличестваВРучную", ПараметрыФормы, ЭтаФорма,,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ГруппаСвайпПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаСтраница_НабранныеТоварыКПеремещению" Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ЯчейкаОткудаГУИД) Или Не ЗначениеЗаполнено(Объект.ЯчейкаКудаГУИД) Тогда
			Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_РаботаСТоваром;
			ПоказатьПредупреждение(,"Ошибка: Введите ячейки ""Откуда"" и ""Куда"" ", 3);	
			Возврат;			
		КонецЕсли; 
		
		РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокТоваровИзБуфераПеремещения(Объект.ЯчейкаОткудаГУИД, Объект.ЯчейкаКудаГУИД);
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			Закрыть();	
			Возврат;
		КонецЕсли; 
	
		Элементы.СписокТоваровВБуфереПеремещения.Обновить();
		
	КонецЕсли; 	
	Элементы.ГруппаОткудаИКуда.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВЯчейках(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ЯчейкаКудаГУИД) Или Не ЗначениеЗаполнено(Объект.ЯчейкаОткудаГУИД) Тогда
		ПоказатьПредупреждение(, "Ячейки ""Откуда"" и ""Куда"" должны быть заполнены", 4);
		Возврат;
	КонецЕсли; 
	
	Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхПриЗакрытииФормыТоварыВвыбранныхЯчейках", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ЯчейкаКуда", Объект.ЯчейкаКуда);
	ПараметрыФормы.Вставить("ЯчейкаКудаПоиск", СтрЗаменить(Объект.ЯчейкаКуда, "-", ""));	
	ПараметрыФормы.Вставить("ЯчейкаКудаГУИД", Объект.ЯчейкаКудаГУИД);
	
	ПараметрыФормы.Вставить("ЯчейкаОткуда", Объект.ЯчейкаОткуда);
	ПараметрыФормы.Вставить("ЯчейкаОткудаПоиск", СтрЗаменить(Объект.ЯчейкаОткуда, "-", ""));	
	ПараметрыФормы.Вставить("ЯчейкаОткудаГУИД", Объект.ЯчейкаОткудаГУИД);	
	
	ОткрытьФорму("Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаТоварыВвыбранныхЯчейках", ПараметрыФормы, ЭтаФорма,,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеДанныхПриЗакрытииФормыТоварыВвыбранныхЯчейках(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЭтаФорма.ТоварГУИД = Результат.ТоварГУИД;
		ЭтаФорма.Штрихкод = "";
		Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_РаботаСТоваром;
		ОбработкаОтсканированногоТовара();	
		
	КонецЕсли; 		
	
КонецПроцедуры                                                                           
 
&НаКлиенте
Процедура ПолучениеДанныхПриЗакрытииФормыВводКоличестваВРучную(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат.ВведеноеКоличествоВРучную = 0 Тогда
		Количество = 1;
	Иначе 
		Количество = Результат.ВведеноеКоличествоВРучную;
	КонецЕсли; 
	
	РучнойВводКоличества[0].ВведенноеКоличествоВРучную = Количество;
		
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДобавитьШтрихкодВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КнопкаДобавитьШтрихкодДобавитьШтрихкод" Тогда
		                                                      				
		Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхДляПрисвоенияШК_ПриЗакрытииФормыТоварыВвыбранныхЯчейках", ЭтаФорма);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СобытиеПрисвоитьШтрихкод", Истина);
		ПараметрыФормы.Вставить("ТипСобытия", "ОбработатьНеизвестныйШтрихкод");
		ПараметрыФормы.Вставить("ЯчейкаКуда", Объект.ЯчейкаКуда);
		ПараметрыФормы.Вставить("ЯчейкаКудаГУИД", Объект.ЯчейкаКудаГУИД);
	
		ПараметрыФормы.Вставить("ЯчейкаОткуда", Объект.ЯчейкаОткуда);
		ПараметрыФормы.Вставить("ЯчейкаОткудаГУИД", Объект.ЯчейкаОткудаГУИД);	
				
		ОткрытьФорму("Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаТоварыВвыбранныхЯчейках", ПараметрыФормы, ЭтаФорма,,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискНоменклатуры");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();

	КонецЕсли; 	
		
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВыбратьТоварИзДокументаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КнопкаВыбратьТоварИзДокументаВыбратьТовар" Тогда
				                                                      				
		Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхПриЗакрытииФормыТоварыВвыбранныхЯчейках", ЭтаФорма);
		                                                      
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СобытиеПрисвоитьШтрихкод", Ложь);
		ПараметрыФормы.Вставить("ТипСобытия", "ОбработатьНеизвестныйШтрихкод");
		
		ПараметрыФормы.Вставить("ЯчейкаКуда", Объект.ЯчейкаКуда);
		ПараметрыФормы.Вставить("ЯчейкаКудаГУИД", Объект.ЯчейкаКудаГУИД);
	
		ПараметрыФормы.Вставить("ЯчейкаОткуда", Объект.ЯчейкаОткуда);
		ПараметрыФормы.Вставить("ЯчейкаОткудаГУИД", Объект.ЯчейкаОткудаГУИД);	
				
		ОткрытьФорму("Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаТоварыВвыбранныхЯчейках", ПараметрыФормы, ЭтаФорма,,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискНоменклатуры");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();

	КонецЕсли; 	

КонецПроцедуры

&НаКлиенте
Процедура КнопкаПропуститьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КнопкаПропуститьПропустить" Тогда
				 
		ЭтаФорма.ОписаниеОшибки = "";
		ЭтаФорма.ОписаниеНайденногоТовара =  "";
		ЭтаФорма.Штрихкод = "";
		ЭтаФорма.Поиск = "";
	
		ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);			
		ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискНоменклатуры");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
		
	КонецЕсли; 	

КонецПроцедуры
 
&НаКлиенте
Процедура ПолучениеДанныхДляПрисвоенияШК_ПриЗакрытииФормыТоварыВвыбранныхЯчейках(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат.СобытиеПрисвоитьШтрихкод = Истина Тогда
						
		ЭтаФорма.ТоварГУИД = Результат.ТоварГУИД;
		РезультатСтруктура = ОбщегоНазначения.ПрисвоитьШтрихкодТовару(ЭтаФорма.Штрихкод, ЭтаФорма.ТоварГУИД);
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 5);	
			ЭтаФорма.ОписаниеОшибки = "";
			ЭтаФорма.ОписаниеНайденногоТовара =  "";
			ЭтаФорма.Штрихкод = "";
			ЭтаФорма.Поиск = "";
	
			ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);			
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ПоискНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		

			Возврат;
			
		Иначе 
			ПоказатьПредупреждение(,"Штрихкод " + Строка(ЭтаФорма.Штрихкод) + " добавлен.", 5);	
		КонецЕсли; 			
		
		СтрокаGS = "";
		ОбработкаОтсканированногоТовара();
		
	Иначе 
				
		ЭтаФорма.ОписаниеОшибки = "";
		ЭтаФорма.ОписаниеНайденногоТовара =  "";
		ЭтаФорма.Штрихкод = "";
		ЭтаФорма.Поиск = "";
	
		ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);			
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ПоискНоменклатуры");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументПеремещенияПослеСканирЯчейкиКуда(Объект) Экспорт
			
	ТекстСообщения = "Создан документ перемещения по ячейкам № %1 %2. Документ проведен";
		
	Результат = ОбщегоНазначения.СоздатьДокументПеремещенияМеждуЯчейкам(Объект.ЯчейкаОткудаГУИД, Объект.ЯчейкаКудаГУИД);
	
	Если ЗначениеЗаполнено(Результат.Ошибка) Тогда                                                      
		
		ПоказатьПредупреждение(,"Ошибка: " + Результат.Ошибка, 4);			
		Закрыть();
		Возврат;
		
	КонецЕсли; 
				
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
					Результат.Данные.НомерДокумента,
					Результат.Данные.ДатаДокумента);						
		
	Оповещение = Новый ОписаниеОповещения("ЗакрытьФормуПослеСообщения", ЭтотОбъект, Параметры);
	ПоказатьПредупреждение(Оповещение, ТекстСообщения, 5);
	СозданДокументПеремещения = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуПослеСообщения(Результат) Экспорт 
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не СозданДокументПеремещения И ЗначениеЗаполнено(Объект.ЯчейкаОткудаГУИД) И  ЗначениеЗаполнено(Объект.ЯчейкаКудаГУИД) Тогда
		
		ТекстСообщения = "Создан документ перемещения по ячейкам № %1 %2. Документ проведен";
			
		Результат = ОбщегоНазначения.СоздатьДокументПеремещенияМеждуЯчейкам(Объект.ЯчейкаОткудаГУИД, Объект.ЯчейкаКудаГУИД);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда                                                      
			ПоказатьПредупреждение(,"Ошибка: " + Результат.Ошибка, 4);			
		Иначе
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
							Результат.Данные.НомерДокумента,
							Результат.Данные.ДатаДокумента);						
				
			ПоказатьПредупреждение(, ТекстСообщения, 5);
			
		КонецЕсли; 
							
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСтатусуПоискаНоменклатуры() Экспорт
	
	СтатусРаботы = ОбщегоНазначения.ПолучитьСтатусРаботыСПеремещениемТовара();
	
	Если СтатусРаботы = "ОпределеныЯчейкиДляПоискаТовара" Тогда
		
		ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискНоменклатуры");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();			
		ОтключитьОбработчикОжидания("ПерейтиКСтатусуПоискаНоменклатуры");				
		
	КонецЕсли;                                                      
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;

КонецПроцедуры
